#+title: Phase 2 LU Factorization
* Phase 2 LU Factorization
Preliminary experiments with the LU Factorization on the Tupi partition.
Changing:
- Matrix size
- Number of Nodes
- GPU
Fixed:
- Scheduler
- Block size
- PxQ factor

#+begin_src R
options(crayon.enabled=FALSE)
library(DoE.base)
library(tidyverse)

fator_size = c(16000, 32000, 64000, 96000)
fator_blocksize = c(400, 800)
fator_scheduler = c("dmda", "lws", "dmdas", "random")
fator_pq = c("1x4", "2x2", "4x1")
fator_gpu = c(1, 0)
fator_nodes = 1:2

job_name = "lu_factor_tupi"

fac.design(nfactors=6,
           replications=1,
           repeat.only= FALSE ,
           randomize=TRUE,
           seed=0,
           nlevels=c(length(fator_size),
                     length(fator_blocksize),
                     length(fator_scheduler),
                     length(fator_pq),
                     length(fator_gpu),
                     length(fator_nodes)),
           factor.names=list(
             size = fator_size,
             block_size = fator_blocksize,
             scheduler = fator_scheduler,
             pq = fator_pq,
             gpu = fator_gpu,
             nodes = fator_nodes
           )) |>
  as_tibble() |>
  filter(scheduler == "lws") |>
  filter(pq == "1x4") |>
  filter(block_size == 400) |>
    mutate(exp = job_name) |>
    mutate(Order = paste0(exp, "_", size, "_", nodes,"_GPU", gpu, "_", 1:n())) |>
  write_csv(paste0(job_name, "_experimental_project.csv"), progress=FALSE) |>
  print()
#+end_src

#+RESULTS:
| 64000 | 400 | lws | 1x4 | 0 | 2 | lu_factor_tupi | lu_factor_tupi_64000_2_GPU0_1  |
| 16000 | 400 | lws | 1x4 | 0 | 1 | lu_factor_tupi | lu_factor_tupi_16000_1_GPU0_2  |
| 96000 | 400 | lws | 1x4 | 0 | 4 | lu_factor_tupi | lu_factor_tupi_96000_4_GPU0_3  |
| 96000 | 400 | lws | 1x4 | 0 | 3 | lu_factor_tupi | lu_factor_tupi_96000_3_GPU0_4  |
| 32000 | 400 | lws | 1x4 | 0 | 3 | lu_factor_tupi | lu_factor_tupi_32000_3_GPU0_5  |
| 64000 | 400 | lws | 1x4 | 0 | 4 | lu_factor_tupi | lu_factor_tupi_64000_4_GPU0_6  |
| 64000 | 400 | lws | 1x4 | 1 | 4 | lu_factor_tupi | lu_factor_tupi_64000_4_GPU1_7  |
| 32000 | 400 | lws | 1x4 | 1 | 4 | lu_factor_tupi | lu_factor_tupi_32000_4_GPU1_8  |
| 96000 | 400 | lws | 1x4 | 0 | 2 | lu_factor_tupi | lu_factor_tupi_96000_2_GPU0_9  |
| 96000 | 400 | lws | 1x4 | 0 | 1 | lu_factor_tupi | lu_factor_tupi_96000_1_GPU0_10 |
| 16000 | 400 | lws | 1x4 | 1 | 2 | lu_factor_tupi | lu_factor_tupi_16000_2_GPU1_11 |
| 16000 | 400 | lws | 1x4 | 1 | 4 | lu_factor_tupi | lu_factor_tupi_16000_4_GPU1_12 |
| 64000 | 400 | lws | 1x4 | 1 | 3 | lu_factor_tupi | lu_factor_tupi_64000_3_GPU1_13 |
| 16000 | 400 | lws | 1x4 | 0 | 4 | lu_factor_tupi | lu_factor_tupi_16000_4_GPU0_14 |
| 64000 | 400 | lws | 1x4 | 1 | 2 | lu_factor_tupi | lu_factor_tupi_64000_2_GPU1_15 |
| 32000 | 400 | lws | 1x4 | 0 | 1 | lu_factor_tupi | lu_factor_tupi_32000_1_GPU0_16 |
| 64000 | 400 | lws | 1x4 | 0 | 3 | lu_factor_tupi | lu_factor_tupi_64000_3_GPU0_17 |
| 16000 | 400 | lws | 1x4 | 0 | 3 | lu_factor_tupi | lu_factor_tupi_16000_3_GPU0_18 |
| 64000 | 400 | lws | 1x4 | 1 | 1 | lu_factor_tupi | lu_factor_tupi_64000_1_GPU1_19 |
| 32000 | 400 | lws | 1x4 | 1 | 3 | lu_factor_tupi | lu_factor_tupi_32000_3_GPU1_20 |
| 96000 | 400 | lws | 1x4 | 1 | 2 | lu_factor_tupi | lu_factor_tupi_96000_2_GPU1_21 |
| 64000 | 400 | lws | 1x4 | 0 | 1 | lu_factor_tupi | lu_factor_tupi_64000_1_GPU0_22 |
| 96000 | 400 | lws | 1x4 | 1 | 1 | lu_factor_tupi | lu_factor_tupi_96000_1_GPU1_23 |
| 32000 | 400 | lws | 1x4 | 1 | 2 | lu_factor_tupi | lu_factor_tupi_32000_2_GPU1_24 |
| 16000 | 400 | lws | 1x4 | 1 | 1 | lu_factor_tupi | lu_factor_tupi_16000_1_GPU1_25 |
| 16000 | 400 | lws | 1x4 | 1 | 3 | lu_factor_tupi | lu_factor_tupi_16000_3_GPU1_26 |
| 96000 | 400 | lws | 1x4 | 1 | 3 | lu_factor_tupi | lu_factor_tupi_96000_3_GPU1_27 |
| 32000 | 400 | lws | 1x4 | 0 | 2 | lu_factor_tupi | lu_factor_tupi_32000_2_GPU0_28 |
| 96000 | 400 | lws | 1x4 | 1 | 4 | lu_factor_tupi | lu_factor_tupi_96000_4_GPU1_29 |
| 32000 | 400 | lws | 1x4 | 0 | 4 | lu_factor_tupi | lu_factor_tupi_32000_4_GPU0_30 |
| 32000 | 400 | lws | 1x4 | 1 | 1 | lu_factor_tupi | lu_factor_tupi_32000_1_GPU1_31 |
| 16000 | 400 | lws | 1x4 | 0 | 2 | lu_factor_tupi | lu_factor_tupi_16000_2_GPU0_32 |
